public class Main5 {
    public static void main(String[] args){
        /*
        Title. 자료형 퀴즈 データ型クイズ
         */

        /*
        1) 자료형 - 퀴즈 1: 문자 변수 'S' , 정수형 변수 10 를 선언 및 출력해보세요.
        1) データ型-クイズ１：文字変数'S', 整数型変数10を宣言および出力しましょう。
         */

        char a = 'S';
        int b = 10;
        System.out.println(a+", "+b); //S, 10


        /*
        2) 자료형 - 퀴즈 2: 크기가 3인 정수형 배열을 선언 및 주어진 숫자 3개를 할당해보세요.
        그리고 배열의 마지막 값을 출력해보세요. (숫자 3개 = 10,20,30)
        2) データ型-クイズ２：大きさが３である整数型配列を宣言し、与えられた数字３つを割り当てしましょう。
        そして、配列の最後の値を出力してみましょう。（数字３つ＝10,20,30）
         */

        int[] numbers = new int[]{10, 20, 30};
        System.out.println(numbers[numbers.length-1]); //30

    }
}
